package labi_java.laba4;

public class Task1 {
    public static void main(String[] args) {
        // Задача 1

        String[] names = new String[] {
            "Павел", "Азат", "Никита", "Илона", "Георгий", "Дмитрий", "Софья", 
            "Вячеслав", "Василий", "Никита", "Дмитрий", "Арсений", "Никита", 
            "Антон", "Егор", "Егор", "Андрей", "Михаил", "Анастасия", "Илья", 
            "Роман", "Денис", "Виктор", "Владислав", "Данил"
        };

        String[] surnames = new String[] {
            "АГЛУШЕВИЧ", "БАЙКИН", "БЕЛОГУР", "БУКАТКА", "ВАЛЯВКО", "ВАСЮК", 
            "ГРИШКЕВИЧ", "ЗАЙЦЕВ", "ЗГУРСКИЙ", "КИБКАЛО", "КОЗАРЬ", "КОНЫЧЕВ", 
            "ЛИХОБАБИН", "МАСАЛЬСКИЙ", "ОЖЕРЕЛЬЕВ", "ПАНЬКОВ", "ПЕТРОВСКИЙ", 
            "ПОНАМАРЕВ", "ПОЯСНЮК", "ПРИТУЖАЛОВ", "ПЧЁЛКИН", "СКОВОРОДИН", 
            "СУЛИМОВ", "ШАТИЛО", "ШЕБАЛОВ"
        };

        //Кол-во эл-тов в общем массиве
        int n = names.length + surnames.length;

        String[] myGroup = new String[n];

        for (int i = 0; i < n; i++) {
            myGroup[i] = switch (i % 2) {
                case 1 -> surnames[i / 2];
                case 0 -> names[i / 2];
                default -> "GIT GUD";
            };

        }

        for (String str: myGroup) {
            System.out.println(str);
        }
    }
}
